zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K322_EMAC.h
#define EMAC_MAC_HW_FEATURE0_ARPOFFSEL_MASK      (0x200U)
#define EMAC_MAC_HW_FEATURE0_ARPOFFSEL_SHIFT     (9U)
#define EMAC_MAC_HW_FEATURE0_ARPOFFSEL_WIDTH     (1U)
#define EMAC_MAC_HW_FEATURE0_ARPOFFSEL(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_ARPOFFSEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_ARPOFFSEL_MASK)

#define EMAC_MAC_HW_FEATURE0_TSSEL_MASK          (0x1000U)
#define EMAC_MAC_HW_FEATURE0_TSSEL_SHIFT         (12U)
#define EMAC_MAC_HW_FEATURE0_TSSEL_WIDTH         (1U)
#define EMAC_MAC_HW_FEATURE0_TSSEL(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_TSSEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_TSSEL_MASK)

#define EMAC_MAC_HW_FEATURE0_EEESEL_MASK         (0x2000U)
#define EMAC_MAC_HW_FEATURE0_EEESEL_SHIFT        (13U)
#define EMAC_MAC_HW_FEATURE0_EEESEL_WIDTH        (1U)
#define EMAC_MAC_HW_FEATURE0_EEESEL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_EEESEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_EEESEL_MASK)

#define EMAC_MAC_HW_FEATURE0_TXCOESEL_MASK       (0x4000U)
#define EMAC_MAC_HW_FEATURE0_TXCOESEL_SHIFT      (14U)
#define EMAC_MAC_HW_FEATURE0_TXCOESEL_WIDTH      (1U)
#define EMAC_MAC_HW_FEATURE0_TXCOESEL(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_TXCOESEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_TXCOESEL_MASK)

#define EMAC_MAC_HW_FEATURE0_RXCOESEL_MASK       (0x10000U)
#define EMAC_MAC_HW_FEATURE0_RXCOESEL_SHIFT      (16U)
#define EMAC_MAC_HW_FEATURE0_RXCOESEL_WIDTH      (1U)
#define EMAC_MAC_HW_FEATURE0_RXCOESEL(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_RXCOESEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_RXCOESEL_MASK)

#define EMAC_MAC_HW_FEATURE0_ADDMACADRSEL_MASK   (0x7C0000U)
#define EMAC_MAC_HW_FEATURE0_ADDMACADRSEL_SHIFT  (18U)
#define EMAC_MAC_HW_FEATURE0_ADDMACADRSEL_WIDTH  (5U)
#define EMAC_MAC_HW_FEATURE0_ADDMACADRSEL(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_ADDMACADRSEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_ADDMACADRSEL_MASK)

#define EMAC_MAC_HW_FEATURE0_MACADR32SEL_MASK    (0x800000U)
#define EMAC_MAC_HW_FEATURE0_MACADR32SEL_SHIFT   (23U)
#define EMAC_MAC_HW_FEATURE0_MACADR32SEL_WIDTH   (1U)
#define EMAC_MAC_HW_FEATURE0_MACADR32SEL(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_MACADR32SEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_MACADR32SEL_MASK)

#define EMAC_MAC_HW_FEATURE0_MACADR64SEL_MASK    (0x1000000U)
#define EMAC_MAC_HW_FEATURE0_MACADR64SEL_SHIFT   (24U)
#define EMAC_MAC_HW_FEATURE0_MACADR64SEL_WIDTH   (1U)
#define EMAC_MAC_HW_FEATURE0_MACADR64SEL(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_MACADR64SEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_MACADR64SEL_MASK)

#define EMAC_MAC_HW_FEATURE0_TSSTSSEL_MASK       (0x6000000U)
#define EMAC_MAC_HW_FEATURE0_TSSTSSEL_SHIFT      (25U)
#define EMAC_MAC_HW_FEATURE0_TSSTSSEL_WIDTH      (2U)
#define EMAC_MAC_HW_FEATURE0_TSSTSSEL(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_TSSTSSEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_TSSTSSEL_MASK)

#define EMAC_MAC_HW_FEATURE0_SAVLANINS_MASK      (0x8000000U)
#define EMAC_MAC_HW_FEATURE0_SAVLANINS_SHIFT     (27U)
#define EMAC_MAC_HW_FEATURE0_SAVLANINS_WIDTH     (1U)
#define EMAC_MAC_HW_FEATURE0_SAVLANINS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_SAVLANINS_SHIFT)) & EMAC_MAC_HW_FEATURE0_SAVLANINS_MASK)

#define EMAC_MAC_HW_FEATURE0_ACTPHYSEL_MASK      (0x70000000U)
#define EMAC_MAC_HW_FEATURE0_ACTPHYSEL_SHIFT     (28U)
#define EMAC_MAC_HW_FEATURE0_ACTPHYSEL_WIDTH     (3U)
#define EMAC_MAC_HW_FEATURE0_ACTPHYSEL(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE0_ACTPHYSEL_SHIFT)) & EMAC_MAC_HW_FEATURE0_ACTPHYSEL_MASK)
/*! @} */

/*! @name MAC_HW_FEATURE1 - MAC Hardware Feature 1 */
/*! @{ */

#define EMAC_MAC_HW_FEATURE1_RXFIFOSIZE_MASK     (0x1FU)
#define EMAC_MAC_HW_FEATURE1_RXFIFOSIZE_SHIFT    (0U)
#define EMAC_MAC_HW_FEATURE1_RXFIFOSIZE_WIDTH    (5U)
#define EMAC_MAC_HW_FEATURE1_RXFIFOSIZE(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_RXFIFOSIZE_SHIFT)) & EMAC_MAC_HW_FEATURE1_RXFIFOSIZE_MASK)

#define EMAC_MAC_HW_FEATURE1_SPRAM_MASK          (0x20U)
#define EMAC_MAC_HW_FEATURE1_SPRAM_SHIFT         (5U)
#define EMAC_MAC_HW_FEATURE1_SPRAM_WIDTH         (1U)
#define EMAC_MAC_HW_FEATURE1_SPRAM(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_SPRAM_SHIFT)) & EMAC_MAC_HW_FEATURE1_SPRAM_MASK)

#define EMAC_MAC_HW_FEATURE1_TXFIFOSIZE_MASK     (0x7C0U)
#define EMAC_MAC_HW_FEATURE1_TXFIFOSIZE_SHIFT    (6U)
#define EMAC_MAC_HW_FEATURE1_TXFIFOSIZE_WIDTH    (5U)
#define EMAC_MAC_HW_FEATURE1_TXFIFOSIZE(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_TXFIFOSIZE_SHIFT)) & EMAC_MAC_HW_FEATURE1_TXFIFOSIZE_MASK)

#define EMAC_MAC_HW_FEATURE1_OSTEN_MASK          (0x800U)
#define EMAC_MAC_HW_FEATURE1_OSTEN_SHIFT         (11U)
#define EMAC_MAC_HW_FEATURE1_OSTEN_WIDTH         (1U)
#define EMAC_MAC_HW_FEATURE1_OSTEN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_OSTEN_SHIFT)) & EMAC_MAC_HW_FEATURE1_OSTEN_MASK)

#define EMAC_MAC_HW_FEATURE1_PTOEN_MASK          (0x1000U)
#define EMAC_MAC_HW_FEATURE1_PTOEN_SHIFT         (12U)
#define EMAC_MAC_HW_FEATURE1_PTOEN_WIDTH         (1U)
#define EMAC_MAC_HW_FEATURE1_PTOEN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_PTOEN_SHIFT)) & EMAC_MAC_HW_FEATURE1_PTOEN_MASK)

#define EMAC_MAC_HW_FEATURE1_ADVTHWORD_MASK      (0x2000U)
#define EMAC_MAC_HW_FEATURE1_ADVTHWORD_SHIFT     (13U)
#define EMAC_MAC_HW_FEATURE1_ADVTHWORD_WIDTH     (1U)
#define EMAC_MAC_HW_FEATURE1_ADVTHWORD(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_ADVTHWORD_SHIFT)) & EMAC_MAC_HW_FEATURE1_ADVTHWORD_MASK)

#define EMAC_MAC_HW_FEATURE1_ADDR64_MASK         (0xC000U)
#define EMAC_MAC_HW_FEATURE1_ADDR64_SHIFT        (14U)
#define EMAC_MAC_HW_FEATURE1_ADDR64_WIDTH        (2U)
#define EMAC_MAC_HW_FEATURE1_ADDR64(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_ADDR64_SHIFT)) & EMAC_MAC_HW_FEATURE1_ADDR64_MASK)

#define EMAC_MAC_HW_FEATURE1_DCBEN_MASK          (0x10000U)
#define EMAC_MAC_HW_FEATURE1_DCBEN_SHIFT         (16U)
#define EMAC_MAC_HW_FEATURE1_DCBEN_WIDTH         (1U)
#define EMAC_MAC_HW_FEATURE1_DCBEN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_DCBEN_SHIFT)) & EMAC_MAC_HW_FEATURE1_DCBEN_MASK)

#define EMAC_MAC_HW_FEATURE1_SPHEN_MASK          (0x20000U)
#define EMAC_MAC_HW_FEATURE1_SPHEN_SHIFT         (17U)
#define EMAC_MAC_HW_FEATURE1_SPHEN_WIDTH         (1U)
#define EMAC_MAC_HW_FEATURE1_SPHEN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_SPHEN_SHIFT)) & EMAC_MAC_HW_FEATURE1_SPHEN_MASK)

#define EMAC_MAC_HW_FEATURE1_TSOEN_MASK          (0x40000U)
#define EMAC_MAC_HW_FEATURE1_TSOEN_SHIFT         (18U)
#define EMAC_MAC_HW_FEATURE1_TSOEN_WIDTH         (1U)
#define EMAC_MAC_HW_FEATURE1_TSOEN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEATURE1_TSOEN_SHIFT)) & EMAC_MAC_HW_FEATURE1_TSOEN_MASK)

