zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K322_EMAC.h
#define EMAC_MAC_L3_L4_CONTROL2_L3PEN2_MASK      (0x1U)
#define EMAC_MAC_L3_L4_CONTROL2_L3PEN2_SHIFT     (0U)
#define EMAC_MAC_L3_L4_CONTROL2_L3PEN2_WIDTH     (1U)
#define EMAC_MAC_L3_L4_CONTROL2_L3PEN2(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_L3PEN2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_L3PEN2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_L3SAM2_MASK      (0x4U)
#define EMAC_MAC_L3_L4_CONTROL2_L3SAM2_SHIFT     (2U)
#define EMAC_MAC_L3_L4_CONTROL2_L3SAM2_WIDTH     (1U)
#define EMAC_MAC_L3_L4_CONTROL2_L3SAM2(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_L3SAM2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_L3SAM2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_L3SAIM2_MASK     (0x8U)
#define EMAC_MAC_L3_L4_CONTROL2_L3SAIM2_SHIFT    (3U)
#define EMAC_MAC_L3_L4_CONTROL2_L3SAIM2_WIDTH    (1U)
#define EMAC_MAC_L3_L4_CONTROL2_L3SAIM2(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_L3SAIM2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_L3SAIM2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_L3DAM2_MASK      (0x10U)
#define EMAC_MAC_L3_L4_CONTROL2_L3DAM2_SHIFT     (4U)
#define EMAC_MAC_L3_L4_CONTROL2_L3DAM2_WIDTH     (1U)
#define EMAC_MAC_L3_L4_CONTROL2_L3DAM2(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_L3DAM2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_L3DAM2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_L3DAIM2_MASK     (0x20U)
#define EMAC_MAC_L3_L4_CONTROL2_L3DAIM2_SHIFT    (5U)
#define EMAC_MAC_L3_L4_CONTROL2_L3DAIM2_WIDTH    (1U)
#define EMAC_MAC_L3_L4_CONTROL2_L3DAIM2(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_L3DAIM2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_L3DAIM2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_L3HSBM2_MASK     (0x7C0U)
#define EMAC_MAC_L3_L4_CONTROL2_L3HSBM2_SHIFT    (6U)
#define EMAC_MAC_L3_L4_CONTROL2_L3HSBM2_WIDTH    (5U)
#define EMAC_MAC_L3_L4_CONTROL2_L3HSBM2(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_L3HSBM2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_L3HSBM2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_L3HDBM2_MASK     (0xF800U)
#define EMAC_MAC_L3_L4_CONTROL2_L3HDBM2_SHIFT    (11U)
#define EMAC_MAC_L3_L4_CONTROL2_L3HDBM2_WIDTH    (5U)
#define EMAC_MAC_L3_L4_CONTROL2_L3HDBM2(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_L3HDBM2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_L3HDBM2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_L4PEN2_MASK      (0x10000U)
#define EMAC_MAC_L3_L4_CONTROL2_L4PEN2_SHIFT     (16U)
#define EMAC_MAC_L3_L4_CONTROL2_L4PEN2_WIDTH     (1U)
#define EMAC_MAC_L3_L4_CONTROL2_L4PEN2(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_L4PEN2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_L4PEN2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_L4SPM2_MASK      (0x40000U)
#define EMAC_MAC_L3_L4_CONTROL2_L4SPM2_SHIFT     (18U)
#define EMAC_MAC_L3_L4_CONTROL2_L4SPM2_WIDTH     (1U)
#define EMAC_MAC_L3_L4_CONTROL2_L4SPM2(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_L4SPM2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_L4SPM2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_L4SPIM2_MASK     (0x80000U)
#define EMAC_MAC_L3_L4_CONTROL2_L4SPIM2_SHIFT    (19U)
#define EMAC_MAC_L3_L4_CONTROL2_L4SPIM2_WIDTH    (1U)
#define EMAC_MAC_L3_L4_CONTROL2_L4SPIM2(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_L4SPIM2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_L4SPIM2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_L4DPM2_MASK      (0x100000U)
#define EMAC_MAC_L3_L4_CONTROL2_L4DPM2_SHIFT     (20U)
#define EMAC_MAC_L3_L4_CONTROL2_L4DPM2_WIDTH     (1U)
#define EMAC_MAC_L3_L4_CONTROL2_L4DPM2(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_L4DPM2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_L4DPM2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_L4DPIM2_MASK     (0x200000U)
#define EMAC_MAC_L3_L4_CONTROL2_L4DPIM2_SHIFT    (21U)
#define EMAC_MAC_L3_L4_CONTROL2_L4DPIM2_WIDTH    (1U)
#define EMAC_MAC_L3_L4_CONTROL2_L4DPIM2(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_L4DPIM2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_L4DPIM2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_DMCHN2_MASK      (0x1000000U)
#define EMAC_MAC_L3_L4_CONTROL2_DMCHN2_SHIFT     (24U)
#define EMAC_MAC_L3_L4_CONTROL2_DMCHN2_WIDTH     (1U)
#define EMAC_MAC_L3_L4_CONTROL2_DMCHN2(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_DMCHN2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_DMCHN2_MASK)

#define EMAC_MAC_L3_L4_CONTROL2_DMCHEN2_MASK     (0x10000000U)
#define EMAC_MAC_L3_L4_CONTROL2_DMCHEN2_SHIFT    (28U)
#define EMAC_MAC_L3_L4_CONTROL2_DMCHEN2_WIDTH    (1U)
#define EMAC_MAC_L3_L4_CONTROL2_DMCHEN2(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL2_DMCHEN2_SHIFT)) & EMAC_MAC_L3_L4_CONTROL2_DMCHEN2_MASK)
/*! @} */

/*! @name MAC_LAYER4_ADDRESS2 - MAC Layer 4 Address 2 */
/*! @{ */

#define EMAC_MAC_LAYER4_ADDRESS2_L4SP2_MASK      (0xFFFFU)
#define EMAC_MAC_LAYER4_ADDRESS2_L4SP2_SHIFT     (0U)
#define EMAC_MAC_LAYER4_ADDRESS2_L4SP2_WIDTH     (16U)
#define EMAC_MAC_LAYER4_ADDRESS2_L4SP2(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER4_ADDRESS2_L4SP2_SHIFT)) & EMAC_MAC_LAYER4_ADDRESS2_L4SP2_MASK)

#define EMAC_MAC_LAYER4_ADDRESS2_L4DP2_MASK      (0xFFFF0000U)
#define EMAC_MAC_LAYER4_ADDRESS2_L4DP2_SHIFT     (16U)
#define EMAC_MAC_LAYER4_ADDRESS2_L4DP2_WIDTH     (16U)
#define EMAC_MAC_LAYER4_ADDRESS2_L4DP2(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER4_ADDRESS2_L4DP2_SHIFT)) & EMAC_MAC_LAYER4_ADDRESS2_L4DP2_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR0_REG2 - MAC Layer 3 Address 0 Reg 2 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR0_REG2_L3A02_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR0_REG2_L3A02_SHIFT   (0U)
#define EMAC_MAC_LAYER3_ADDR0_REG2_L3A02_WIDTH   (32U)
#define EMAC_MAC_LAYER3_ADDR0_REG2_L3A02(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR0_REG2_L3A02_SHIFT)) & EMAC_MAC_LAYER3_ADDR0_REG2_L3A02_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR1_REG2 - MAC Layer 3 Address 1 Reg 2 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_SHIFT   (0U)
#define EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_WIDTH   (32U)
#define EMAC_MAC_LAYER3_ADDR1_REG2_L3A12(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_SHIFT)) & EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR2_REG2 - MAC Layer 3 Address 2 Reg 2 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_SHIFT   (0U)
#define EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_WIDTH   (32U)
#define EMAC_MAC_LAYER3_ADDR2_REG2_L3A22(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_SHIFT)) & EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR3_REG2 - MAC Layer 3 Address 3 Reg 2 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_SHIFT   (0U)
#define EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_WIDTH   (32U)
#define EMAC_MAC_LAYER3_ADDR3_REG2_L3A32(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_SHIFT)) & EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_MASK)
/*! @} */

/*! @name MAC_L3_L4_CONTROL3 - MAC L3 L4 Control 3 */
/*! @{ */

#define EMAC_MAC_L3_L4_CONTROL3_L3PEN3_MASK      (0x1U)
#define EMAC_MAC_L3_L4_CONTROL3_L3PEN3_SHIFT     (0U)
#define EMAC_MAC_L3_L4_CONTROL3_L3PEN3_WIDTH     (1U)
#define EMAC_MAC_L3_L4_CONTROL3_L3PEN3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3PEN3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3PEN3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L3SAM3_MASK      (0x4U)
#define EMAC_MAC_L3_L4_CONTROL3_L3SAM3_SHIFT     (2U)
#define EMAC_MAC_L3_L4_CONTROL3_L3SAM3_WIDTH     (1U)
#define EMAC_MAC_L3_L4_CONTROL3_L3SAM3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3SAM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3SAM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L3SAIM3_MASK     (0x8U)
#define EMAC_MAC_L3_L4_CONTROL3_L3SAIM3_SHIFT    (3U)
#define EMAC_MAC_L3_L4_CONTROL3_L3SAIM3_WIDTH    (1U)
#define EMAC_MAC_L3_L4_CONTROL3_L3SAIM3(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3SAIM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3SAIM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L3DAM3_MASK      (0x10U)
#define EMAC_MAC_L3_L4_CONTROL3_L3DAM3_SHIFT     (4U)
#define EMAC_MAC_L3_L4_CONTROL3_L3DAM3_WIDTH     (1U)
#define EMAC_MAC_L3_L4_CONTROL3_L3DAM3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3DAM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3DAM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L3DAIM3_MASK     (0x20U)
#define EMAC_MAC_L3_L4_CONTROL3_L3DAIM3_SHIFT    (5U)
#define EMAC_MAC_L3_L4_CONTROL3_L3DAIM3_WIDTH    (1U)
#define EMAC_MAC_L3_L4_CONTROL3_L3DAIM3(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3DAIM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3DAIM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_MASK     (0x7C0U)
#define EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_SHIFT    (6U)
#define EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_WIDTH    (5U)
#define EMAC_MAC_L3_L4_CONTROL3_L3HSBM3(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_MASK     (0xF800U)
#define EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_SHIFT    (11U)
#define EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_WIDTH    (5U)
#define EMAC_MAC_L3_L4_CONTROL3_L3HDBM3(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_MASK)

