zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K322_EMAC.h
#define EMAC_MTL_RXQ0_DEBUG_RXQSTS_MASK          (0x30U)
#define EMAC_MTL_RXQ0_DEBUG_RXQSTS_SHIFT         (4U)
#define EMAC_MTL_RXQ0_DEBUG_RXQSTS_WIDTH         (2U)
#define EMAC_MTL_RXQ0_DEBUG_RXQSTS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQ0_DEBUG_RXQSTS_SHIFT)) & EMAC_MTL_RXQ0_DEBUG_RXQSTS_MASK)

#define EMAC_MTL_RXQ0_DEBUG_PRXQ_MASK            (0x3FFF0000U)
#define EMAC_MTL_RXQ0_DEBUG_PRXQ_SHIFT           (16U)
#define EMAC_MTL_RXQ0_DEBUG_PRXQ_WIDTH           (14U)
#define EMAC_MTL_RXQ0_DEBUG_PRXQ(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQ0_DEBUG_PRXQ_SHIFT)) & EMAC_MTL_RXQ0_DEBUG_PRXQ_MASK)
/*! @} */

/*! @name MTL_RXQ0_CONTROL - MTL Rx Queue 0 Control 0 */
/*! @{ */

#define EMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_MASK      (0x7U)
#define EMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_SHIFT     (0U)
#define EMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_WIDTH     (3U)
#define EMAC_MTL_RXQ0_CONTROL_RXQ_WEGT(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_SHIFT)) & EMAC_MTL_RXQ0_CONTROL_RXQ_WEGT_MASK)

#define EMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_MASK (0x8U)
#define EMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_SHIFT (3U)
#define EMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_WIDTH (1U)
#define EMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_SHIFT)) & EMAC_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT_MASK)
/*! @} */

/*! @name MTL_TXQ1_OPERATION_MODE - MTL Tx Queue 1 Operation Mode */
/*! @{ */

#define EMAC_MTL_TXQ1_OPERATION_MODE_FTQ_MASK    (0x1U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_FTQ_SHIFT   (0U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_FTQ_WIDTH   (1U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_FTQ(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_OPERATION_MODE_FTQ_SHIFT)) & EMAC_MTL_TXQ1_OPERATION_MODE_FTQ_MASK)

#define EMAC_MTL_TXQ1_OPERATION_MODE_TSF_MASK    (0x2U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TSF_SHIFT   (1U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TSF_WIDTH   (1U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TSF(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_OPERATION_MODE_TSF_SHIFT)) & EMAC_MTL_TXQ1_OPERATION_MODE_TSF_MASK)

#define EMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_MASK  (0xCU)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_SHIFT (2U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_WIDTH (2U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TXQEN(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_SHIFT)) & EMAC_MTL_TXQ1_OPERATION_MODE_TXQEN_MASK)

#define EMAC_MTL_TXQ1_OPERATION_MODE_TTC_MASK    (0x70U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TTC_SHIFT   (4U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TTC_WIDTH   (3U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TTC(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_OPERATION_MODE_TTC_SHIFT)) & EMAC_MTL_TXQ1_OPERATION_MODE_TTC_MASK)

#define EMAC_MTL_TXQ1_OPERATION_MODE_TQS_MASK    (0x1F0000U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TQS_SHIFT   (16U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TQS_WIDTH   (5U)
#define EMAC_MTL_TXQ1_OPERATION_MODE_TQS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_OPERATION_MODE_TQS_SHIFT)) & EMAC_MTL_TXQ1_OPERATION_MODE_TQS_MASK)
/*! @} */

/*! @name MTL_TXQ1_UNDERFLOW - MTL Tx Queue 1 Underflow */
/*! @{ */

#define EMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_MASK    (0x7FFU)
#define EMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_SHIFT   (0U)
#define EMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_WIDTH   (11U)
#define EMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_SHIFT)) & EMAC_MTL_TXQ1_UNDERFLOW_UFFRMCNT_MASK)

#define EMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF_MASK    (0x800U)
#define EMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF_SHIFT   (11U)
#define EMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF_WIDTH   (1U)
#define EMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF_SHIFT)) & EMAC_MTL_TXQ1_UNDERFLOW_UFCNTOVF_MASK)
/*! @} */

/*! @name MTL_TXQ1_DEBUG - MTL Tx Queue 1 Debug */
/*! @{ */

#define EMAC_MTL_TXQ1_DEBUG_TXQPAUSED_MASK       (0x1U)
#define EMAC_MTL_TXQ1_DEBUG_TXQPAUSED_SHIFT      (0U)
#define EMAC_MTL_TXQ1_DEBUG_TXQPAUSED_WIDTH      (1U)
#define EMAC_MTL_TXQ1_DEBUG_TXQPAUSED(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_DEBUG_TXQPAUSED_SHIFT)) & EMAC_MTL_TXQ1_DEBUG_TXQPAUSED_MASK)

#define EMAC_MTL_TXQ1_DEBUG_TRCSTS_MASK          (0x6U)
#define EMAC_MTL_TXQ1_DEBUG_TRCSTS_SHIFT         (1U)
#define EMAC_MTL_TXQ1_DEBUG_TRCSTS_WIDTH         (2U)
#define EMAC_MTL_TXQ1_DEBUG_TRCSTS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_DEBUG_TRCSTS_SHIFT)) & EMAC_MTL_TXQ1_DEBUG_TRCSTS_MASK)

#define EMAC_MTL_TXQ1_DEBUG_TWCSTS_MASK          (0x8U)
#define EMAC_MTL_TXQ1_DEBUG_TWCSTS_SHIFT         (3U)
#define EMAC_MTL_TXQ1_DEBUG_TWCSTS_WIDTH         (1U)
#define EMAC_MTL_TXQ1_DEBUG_TWCSTS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_DEBUG_TWCSTS_SHIFT)) & EMAC_MTL_TXQ1_DEBUG_TWCSTS_MASK)

#define EMAC_MTL_TXQ1_DEBUG_TXQSTS_MASK          (0x10U)
#define EMAC_MTL_TXQ1_DEBUG_TXQSTS_SHIFT         (4U)
#define EMAC_MTL_TXQ1_DEBUG_TXQSTS_WIDTH         (1U)
#define EMAC_MTL_TXQ1_DEBUG_TXQSTS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_DEBUG_TXQSTS_SHIFT)) & EMAC_MTL_TXQ1_DEBUG_TXQSTS_MASK)

#define EMAC_MTL_TXQ1_DEBUG_TXSTSFSTS_MASK       (0x20U)
#define EMAC_MTL_TXQ1_DEBUG_TXSTSFSTS_SHIFT      (5U)
#define EMAC_MTL_TXQ1_DEBUG_TXSTSFSTS_WIDTH      (1U)
#define EMAC_MTL_TXQ1_DEBUG_TXSTSFSTS(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_DEBUG_TXSTSFSTS_SHIFT)) & EMAC_MTL_TXQ1_DEBUG_TXSTSFSTS_MASK)

#define EMAC_MTL_TXQ1_DEBUG_PTXQ_MASK            (0x70000U)
#define EMAC_MTL_TXQ1_DEBUG_PTXQ_SHIFT           (16U)
#define EMAC_MTL_TXQ1_DEBUG_PTXQ_WIDTH           (3U)
#define EMAC_MTL_TXQ1_DEBUG_PTXQ(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_DEBUG_PTXQ_SHIFT)) & EMAC_MTL_TXQ1_DEBUG_PTXQ_MASK)

#define EMAC_MTL_TXQ1_DEBUG_STXSTSF_MASK         (0x700000U)
#define EMAC_MTL_TXQ1_DEBUG_STXSTSF_SHIFT        (20U)
#define EMAC_MTL_TXQ1_DEBUG_STXSTSF_WIDTH        (3U)
#define EMAC_MTL_TXQ1_DEBUG_STXSTSF(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_DEBUG_STXSTSF_SHIFT)) & EMAC_MTL_TXQ1_DEBUG_STXSTSF_MASK)
/*! @} */

/*! @name MTL_TXQ1_ETS_CONTROL - MTL Tx Queue 1 ETS Control */
/*! @{ */

#define EMAC_MTL_TXQ1_ETS_CONTROL_AVALG_MASK     (0x4U)
#define EMAC_MTL_TXQ1_ETS_CONTROL_AVALG_SHIFT    (2U)
#define EMAC_MTL_TXQ1_ETS_CONTROL_AVALG_WIDTH    (1U)
#define EMAC_MTL_TXQ1_ETS_CONTROL_AVALG(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_ETS_CONTROL_AVALG_SHIFT)) & EMAC_MTL_TXQ1_ETS_CONTROL_AVALG_MASK)

#define EMAC_MTL_TXQ1_ETS_CONTROL_CC_MASK        (0x8U)
#define EMAC_MTL_TXQ1_ETS_CONTROL_CC_SHIFT       (3U)
#define EMAC_MTL_TXQ1_ETS_CONTROL_CC_WIDTH       (1U)
#define EMAC_MTL_TXQ1_ETS_CONTROL_CC(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_ETS_CONTROL_CC_SHIFT)) & EMAC_MTL_TXQ1_ETS_CONTROL_CC_MASK)

#define EMAC_MTL_TXQ1_ETS_CONTROL_SLC_MASK       (0x70U)
#define EMAC_MTL_TXQ1_ETS_CONTROL_SLC_SHIFT      (4U)
#define EMAC_MTL_TXQ1_ETS_CONTROL_SLC_WIDTH      (3U)
#define EMAC_MTL_TXQ1_ETS_CONTROL_SLC(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ1_ETS_CONTROL_SLC_SHIFT)) & EMAC_MTL_TXQ1_ETS_CONTROL_SLC_MASK)
/*! @} */

/*! @name MTL_TXQ1_ETS_STATUS - MTL Tx Queue 1 ETS Status */
/*! @{ */

