zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K322_EMAC.h
#define EMAC_DMA_TBS_CTRL_FTOS_MASK              (0xFFFFFF00U)
#define EMAC_DMA_TBS_CTRL_FTOS_SHIFT             (8U)
#define EMAC_DMA_TBS_CTRL_FTOS_WIDTH             (24U)
#define EMAC_DMA_TBS_CTRL_FTOS(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_TBS_CTRL_FTOS_SHIFT)) & EMAC_DMA_TBS_CTRL_FTOS_MASK)
/*! @} */

/*! @name DMA_SAFETY_INTERRUPT_STATUS - DMA Safety Interrupt Status */
/*! @{ */

#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_MASK (0x1U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_SHIFT (0U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_WIDTH (1U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_SHIFT)) & EMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_MASK)

#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_MASK (0x2U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_SHIFT (1U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_WIDTH (1U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_SHIFT)) & EMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_MASK)

#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_MASK (0x10000000U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_SHIFT (28U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_WIDTH (1U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_SHIFT)) & EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_MASK)

#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_MASK (0x20000000U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_SHIFT (29U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_WIDTH (1U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_SHIFT)) & EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_MASK)

#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_MASK (0x80000000U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_SHIFT (31U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_WIDTH (1U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_SHIFT)) & EMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_MASK)
/*! @} */

/*! @name DMA_CH0_CONTROL - DMA Channel 0 Control */
/*! @{ */

#define EMAC_DMA_CH0_CONTROL_PBLx8_MASK          (0x10000U)
#define EMAC_DMA_CH0_CONTROL_PBLx8_SHIFT         (16U)
#define EMAC_DMA_CH0_CONTROL_PBLx8_WIDTH         (1U)
#define EMAC_DMA_CH0_CONTROL_PBLx8(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_CONTROL_PBLx8_SHIFT)) & EMAC_DMA_CH0_CONTROL_PBLx8_MASK)

#define EMAC_DMA_CH0_CONTROL_DSL_MASK            (0x1C0000U)
#define EMAC_DMA_CH0_CONTROL_DSL_SHIFT           (18U)
#define EMAC_DMA_CH0_CONTROL_DSL_WIDTH           (3U)
#define EMAC_DMA_CH0_CONTROL_DSL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_CONTROL_DSL_SHIFT)) & EMAC_DMA_CH0_CONTROL_DSL_MASK)
/*! @} */

/*! @name DMA_CH0_TX_CONTROL - DMA Channel Tx Control */
/*! @{ */

#define EMAC_DMA_CH0_TX_CONTROL_ST_MASK          (0x1U)
#define EMAC_DMA_CH0_TX_CONTROL_ST_SHIFT         (0U)
#define EMAC_DMA_CH0_TX_CONTROL_ST_WIDTH         (1U)
#define EMAC_DMA_CH0_TX_CONTROL_ST(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_TX_CONTROL_ST_SHIFT)) & EMAC_DMA_CH0_TX_CONTROL_ST_MASK)

#define EMAC_DMA_CH0_TX_CONTROL_TCW_MASK         (0xEU)
#define EMAC_DMA_CH0_TX_CONTROL_TCW_SHIFT        (1U)
#define EMAC_DMA_CH0_TX_CONTROL_TCW_WIDTH        (3U)
#define EMAC_DMA_CH0_TX_CONTROL_TCW(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_TX_CONTROL_TCW_SHIFT)) & EMAC_DMA_CH0_TX_CONTROL_TCW_MASK)

#define EMAC_DMA_CH0_TX_CONTROL_OSF_MASK         (0x10U)
#define EMAC_DMA_CH0_TX_CONTROL_OSF_SHIFT        (4U)
#define EMAC_DMA_CH0_TX_CONTROL_OSF_WIDTH        (1U)
#define EMAC_DMA_CH0_TX_CONTROL_OSF(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_TX_CONTROL_OSF_SHIFT)) & EMAC_DMA_CH0_TX_CONTROL_OSF_MASK)

#define EMAC_DMA_CH0_TX_CONTROL_TxPBL_MASK       (0x3F0000U)
#define EMAC_DMA_CH0_TX_CONTROL_TxPBL_SHIFT      (16U)
#define EMAC_DMA_CH0_TX_CONTROL_TxPBL_WIDTH      (6U)
#define EMAC_DMA_CH0_TX_CONTROL_TxPBL(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_TX_CONTROL_TxPBL_SHIFT)) & EMAC_DMA_CH0_TX_CONTROL_TxPBL_MASK)

#define EMAC_DMA_CH0_TX_CONTROL_ETIC_MASK        (0x400000U)
#define EMAC_DMA_CH0_TX_CONTROL_ETIC_SHIFT       (22U)
#define EMAC_DMA_CH0_TX_CONTROL_ETIC_WIDTH       (1U)
#define EMAC_DMA_CH0_TX_CONTROL_ETIC(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_TX_CONTROL_ETIC_SHIFT)) & EMAC_DMA_CH0_TX_CONTROL_ETIC_MASK)

#define EMAC_DMA_CH0_TX_CONTROL_EDSE_MASK        (0x10000000U)
#define EMAC_DMA_CH0_TX_CONTROL_EDSE_SHIFT       (28U)
#define EMAC_DMA_CH0_TX_CONTROL_EDSE_WIDTH       (1U)
#define EMAC_DMA_CH0_TX_CONTROL_EDSE(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_TX_CONTROL_EDSE_SHIFT)) & EMAC_DMA_CH0_TX_CONTROL_EDSE_MASK)
/*! @} */

/*! @name DMA_CH0_RX_CONTROL - DMA Channel Rx Control */
/*! @{ */

#define EMAC_DMA_CH0_RX_CONTROL_SR_MASK          (0x1U)
#define EMAC_DMA_CH0_RX_CONTROL_SR_SHIFT         (0U)
#define EMAC_DMA_CH0_RX_CONTROL_SR_WIDTH         (1U)
#define EMAC_DMA_CH0_RX_CONTROL_SR(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_RX_CONTROL_SR_SHIFT)) & EMAC_DMA_CH0_RX_CONTROL_SR_MASK)

#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_x_0_MASK    (0x6U)
#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_x_0_SHIFT   (1U)
#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_x_0_WIDTH   (2U)
#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_x_0(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_RX_CONTROL_RBSZ_x_0_SHIFT)) & EMAC_DMA_CH0_RX_CONTROL_RBSZ_x_0_MASK)

#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_y_MASK   (0x7FF8U)
#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_y_SHIFT  (3U)
#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_y_WIDTH  (12U)
#define EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_y(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_y_SHIFT)) & EMAC_DMA_CH0_RX_CONTROL_RBSZ_13_y_MASK)

#define EMAC_DMA_CH0_RX_CONTROL_RxPBL_MASK       (0x3F0000U)
#define EMAC_DMA_CH0_RX_CONTROL_RxPBL_SHIFT      (16U)
#define EMAC_DMA_CH0_RX_CONTROL_RxPBL_WIDTH      (6U)
#define EMAC_DMA_CH0_RX_CONTROL_RxPBL(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH0_RX_CONTROL_RxPBL_SHIFT)) & EMAC_DMA_CH0_RX_CONTROL_RxPBL_MASK)

